In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler

In [ ]:
df = pd.read_csv('kalimati_tarkari_dataset_cleaned.csv')

In [ ]:
backup=df.copy()

In [ ]:
df.head()

   SN            Commodity        Date Unit  Minimum  Maximum  Average
0   0   Tomato Big(Nepali)  2013-06-16   Kg     35.0     40.0     37.5
1   1  Tomato Small(Local)  2013-06-16   Kg     26.0     32.0     29.0
2   2           Potato Red  2013-06-16   Kg     20.0     21.0     20.5
3   3         Potato White  2013-06-16   Kg     15.0     16.0     15.5
4   4   Onion Dry (Indian)  2013-06-16   Kg     28.0     30.0     29.0

In [ ]:
df.tail()

            SN            Commodity        Date Unit  Minimum  Maximum  Average
197156  197156    Garlic Dry Nepali  2021-05-13   Kg    100.0    120.0    110.0
197157  197157     Fish Fresh(Rahu)  2021-05-13   KG    270.0    280.0    275.0
197158  197158  Fish Fresh(Bachuwa)  2021-05-13   KG    225.0    235.0    230.0
197159  197159   Fish Fresh(Chhadi)  2021-05-13   KG    220.0    230.0    225.0
197160  197160  Fish Fresh(Mungari)  2021-05-13   KG    240.0    250.0    245.0

In [ ]:
df.columns

Index(['SN', 'Commodity', 'Date', 'Unit', 'Minimum', 'Maximum', 'Average'], dtype='object')

In [ ]:
df.shape

(197161, 7)

In [ ]:
df.describe()

                  SN        Minimum        Maximum        Average
count  197161.000000  197161.000000  197161.000000  197161.000000
mean    98580.000000      85.423938      94.161284      89.792611
std     56915.622549      77.058896      82.375858      79.619003
min         0.000000       1.000000       6.000000       5.000000
25%     49290.000000      40.000000      45.000000      42.500000
50%     98580.000000      60.000000      70.000000      65.000000
75%    147870.000000     100.000000     110.000000     105.000000
max    197160.000000    1800.000000    2000.000000    1900.000000

In [ ]:
df.isnull().sum()

SN           0
Commodity    0
Date         0
Unit         0
Minimum      0
Maximum      0
Average      0
dtype: int64

In [ ]:
df=df.dropna(axis=0)

In [ ]:
df.isnull().sum()

SN           0
Commodity    0
Date         0
Unit         0
Minimum      0
Maximum      0
Average      0
dtype: int64

In [ ]:
df.head()

   SN            Commodity        Date Unit  Minimum  Maximum  Average
0   0   Tomato Big(Nepali)  2013-06-16   Kg     35.0     40.0     37.5
1   1  Tomato Small(Local)  2013-06-16   Kg     26.0     32.0     29.0
2   2           Potato Red  2013-06-16   Kg     20.0     21.0     20.5
3   3         Potato White  2013-06-16   Kg     15.0     16.0     15.5
4   4   Onion Dry (Indian)  2013-06-16   Kg     28.0     30.0     29.0

In [ ]:
df1 = df[df.Commodity=="Tomato Big(Nepali)"].drop(columns='SN')

In [ ]:
df1.head()

              Commodity        Date Unit  Minimum  Maximum  Average
0    Tomato Big(Nepali)  2013-06-16   Kg     35.0     40.0     37.5
74   Tomato Big(Nepali)  2013-06-17   Kg     25.0     30.0     27.5
147  Tomato Big(Nepali)  2013-06-18   Kg     25.0     30.0     27.5
220  Tomato Big(Nepali)  2013-06-19   Kg     25.0     30.0     27.5
293  Tomato Big(Nepali)  2013-06-20   Kg     25.0     30.0     27.5

In [ ]:
df1.reset_index(drop=True)

               Commodity        Date Unit  Minimum  Maximum  Average
0     Tomato Big(Nepali)  2013-06-16   Kg     35.0     40.0     37.5
1     Tomato Big(Nepali)  2013-06-17   Kg     25.0     30.0     27.5
2     Tomato Big(Nepali)  2013-06-18   Kg     25.0     30.0     27.5
3     Tomato Big(Nepali)  2013-06-19   Kg     25.0     30.0     27.5
4     Tomato Big(Nepali)  2013-06-20   Kg     25.0     30.0     27.5
...                  ...         ...  ...      ...      ...      ...
2502  Tomato Big(Nepali)  2021-05-05   Kg     40.0     50.0     45.0
2503  Tomato Big(Nepali)  2021-05-06   Kg     40.0     50.0     45.0
2504  Tomato Big(Nepali)  2021-05-07   Kg     40.0     50.0     45.0
2505  Tomato Big(Nepali)  2021-05-12   Kg     45.0     50.0     47.5
2506  Tomato Big(Nepali)  2021-05-13   Kg     45.0     50.0     47.5

[2507 rows x 6 columns]

In [ ]:
df1.rename(columns={'Average': 'Price'}, inplace=True)

In [ ]:
df1['Date'] = df1['Date'].str.replace('-','').astype(int)

In [ ]:
df1.to_csv('Tomato_cleaned_data.csv')

**Model**

In [ ]:
x=df1['Date']
y=df1['Price']

In [ ]:
len(x)
len(y)

2507

In [ ]:
from sklearn import linear_model
from sklearn.metrics import mean_squared_error

In [ ]:
x_train = x[:-2000].values.reshape(-1,1)

In [ ]:
x_test = x[-500:].values.reshape(-1,1)

In [ ]:
y_train = y[:-2000]

In [ ]:
y_test = y[-500:]

In [ ]:
model = linear_model.LinearRegression()

In [ ]:
model.fit(x_train,y_train)

LinearRegression()

In [ ]:
y_predict = model.predict(x_test)

In [ ]:
print("Mean squared error is:", mean_squared_error(y_test,y_predict))

Mean squared error is: 10118.295550439976

In [ ]:
#visulaization